#location index location

import pandas as pd

data = [
    ['삼성', '1000', '2000'],
    ['현대', '1100', '3000'],
    ['LG', '2000', '500'],
    ['아모레', '3500', '6000'],
    ['네이버', '100', '1500'],
]

index = ['031', '059', '033', '045', '032']
columns = ['종목명', '시가', '종가']

df = pd.DataFrame(data=data, index=index, columns=columns)

print(df)
    #  종목명    시가    종가
# 031   삼성  1000  2000     
# 059   현대  1100  3000     
# 033   LG  2000   500       
# 045  아모레  3500  6000    
# 032  네이버   100  1500 
print('========================================================')
# print(df[0]) #error
# print(df['031']) #error
print(df['시가']) # 판다스 열 행이기 때문에 *** 컬럼이 기준 ***

# print(df[3,0]) # key error
# print(df['045','아모레']) # key error
# print(df['종목명', '045']) # key error
print(df['종목명']['045']) # 판다스 열행이라 출력 됨

print('====================================================')
###################################################
### loc : 인덱스 기준으로 행 데이터 추출
### iloc : 행번호를 기준으로 행 데이터 추출
   # 인트loc = 인트 로케이션 으로 외우자
###################################################

print('======================= 아모레 추출 ===============================')

# print(df.iloc['045']) # 에러
# print(df.iloc[3]) # 잘 뽑힘
# 종목명     아모레
# 시가     3500
# 종가     6000

# print(df.loc[3]) # 에러
# print(df.loc['045']) # 잘 뽑힘
# 종목명     아모레
# 시가     3500
# 종가     6000

# print(df.iloc[4])
# 종목명     네이버
# 시가      100
# 종가     1500
# print(df.loc['032'])
# 종목명     네이버
# 시가      100
# 종가     1500

print('===================== 아모레 종가 뽑기 =============================')

# print(df.loc['045']['종가'])
# print(df.loc['045','종가'])
# print(df.loc['045'].loc['종가'])
# 6000
# 6000
# 6000

# print(df.iloc[3][2]) # 6000 판다스 1에서는 되고 판다스2에서는 워닝뜨지만 실행가능.
# print(df.iloc[3,2])    # 6000
# print(df.iloc[3].iloc[2]) # 6000

# print(df.loc['045'][2]) # 6000
# print(df.loc['045',2]) # key error

# print(df.iloc[3]['종가']) # 6000
# print(df.iloc[3,'종가']) # error

print(df.loc['045'].iloc[2]) # 6000
print(df.iloc[3].loc['종가']) # 6000
























